journal/carson.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:nil arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:nil
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: IT meeting
#+date: <2019-11-20 Wed>
#+author: Cole Turner, Carson Page
#+email: cole@colexml
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 26.3 (Org mode 9.2.5)
* Initial questions
- AWS unknowns?
- vLAN map/verify
- UPS login?
- vSphere HA replication
- Switch/patch panel labels
- GENESYS walkthrough
  - Simulator/x-parameters
  - Sys parameter model
  - GENESYS library
- [[https://www.minicircuits.com/WebStore/x_mwblock.html][minicircuits]] web-API (searchAPI)
- extra server ideas?
- Where did we get SSL cert? How is it renewed?
* 12:32 - S3 buckets
- cf-templates X
- elasticbeanstalk X
- cjk-cascade-test X
- kops-xmicrowave-store X
- pki.xmicrowave.com KEEP
- prod-kops X
- x-microwave.com KEEP
- x-microwave.net KEEP
- xm-codedeploy X
- datapipeline KEEP
- elb logs KEEP
- raspi image X?
- serverless deploy stuff ??
* DONE Centralized logging on S3/EC2
CLOSED: [2020-01-02 Thu 19:12]
* 13:19 - CASCADE DB
- deploy.sh - *CI/CD* instance
- DockerFile
  - alpine Linux, layered cache
  - creates docker container on CI/CD instance
  - CI/CD uploads on gitlab
  - =.gitlab-ci.yml= how it's deployed
    - then =deploy.sh=
      - kills docker container
      - removes it
      - manage secret variables
      - replace and run
      - traefik: port router within docker
      - network web: docker vLan equiv
    - /Portainer is just a convenient human tool/
** DONE centralized logging on docker
CLOSED: [2020-01-02 Thu 19:12]
* 13:53 Gitlab runner
- CI/CD machine
* DONE edit .gitlab-ci files
CLOSED: [2020-01-02 Thu 19:12]
- don't overwrite temp folder (env, dp)
- see Sparameter viewerNX
* 14:01 Genesys
1. add-part json
2. job queue, translate json to automation (mouse/click sequence)
3. genesys runner

- integrate genesys in with cascade and filemaker info
* 14:05 Simulator
- generated genesys XML library
- json data in mongoDB
- reverse proxy is similar to traefik
- converted json to genesys XML in simulator
- REDIS is used as the queue server by javascript in simulator
- /Genesys XML format help - reach out to Carson/
  - filemaker genesys file scripts are documented, read those
- Genesys packager
  - update library from the website
* 14:28 Sys parameters
- cross between X params and S-params
- look for genesys "import/export sys parameters" on filemaker
* 14:37 minicircuits web api
- SearchApi internally uses filemaker "SearchTool"
- minicircuits emulates older search api
- see "proto buf"

- filemaker -> mer file (basically csv) -> main.rs w/ serde library -> rustoso tool
* 14:47 Networking
- See networking in the wiki
- CIDR networking concepts
- pfBlocker Black list
** DONE colored lists, varying security levels
CLOSED: [2020-01-02 Thu 19:12]
- black -> red -> yellow
* 14:55 UPS
- don't rely on automatic shut down stuff currently
** DONE Find and/or reset login
CLOSED: [2020-01-02 Thu 19:12]
** DONE Automatic server shut down
CLOSED: [2020-01-02 Thu 19:12]
* 14:56 HA cluster
- r610s can't run latest ESXi
- turn r610s into VMware HA SAN server (isczi)?
* 15:00 Getting new servers
- Dell servers
- Trend Micro custom built
- Ryzen servers, AMD epic.
- "whitebox" your own
- deals on craigslist
