journal/carson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-20 Wed 15:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>IT meeting</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Cole Turner, Carson Page" />
</head>
<body>
<div id="content">
<h1 class="title">IT meeting</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf0f56e7">Initial questions</a></li>
<li><a href="#org18ab874">12:32 - S3 buckets</a></li>
<li><a href="#org4f6bc31"><span class="todo TODO">TODO</span> Centralized logging on S3</a></li>
<li><a href="#org8e5ad64">13:19 - CASCADE DB</a>
<ul>
<li><a href="#org65c25ae"><span class="todo TODO">TODO</span> centralized logging on docker</a></li>
</ul>
</li>
<li><a href="#org9d436cd">13:53 Gitlab runner</a></li>
<li><a href="#org3a27026"><span class="todo TODO">TODO</span> edit .gitlab-ci files</a></li>
<li><a href="#org79a49f4">14:01 Genesys</a></li>
<li><a href="#org7dea3b7">14:05 Simulator</a></li>
<li><a href="#org7277577">14:28 Sys parameters</a></li>
<li><a href="#org6ebae39">14:37 minicircuits web api</a></li>
<li><a href="#org9400528">14:47 Networking</a>
<ul>
<li><a href="#orgfcf686d"><span class="todo TODO">TODO</span> colored lists, varying security levels</a></li>
</ul>
</li>
<li><a href="#orgc173cf9">14:55 UPS</a>
<ul>
<li><a href="#org7e88986"><span class="todo TODO">TODO</span> Find and/or reset login</a></li>
<li><a href="#orgb336c47"><span class="todo TODO">TODO</span> Automatic server shut down</a></li>
</ul>
</li>
<li><a href="#orgd16c54c">14:56 HA cluster</a></li>
<li><a href="#org88f3c4a">15:00 Getting new servers</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgf0f56e7" class="outline-2">
<h2 id="orgf0f56e7">Initial questions</h2>
<div class="outline-text-2" id="text-orgf0f56e7">
<ul class="org-ul">
<li>AWS unknowns?<br /></li>
<li>vLAN map/verify<br /></li>
<li>UPS login?<br /></li>
<li>vSphere HA replication<br /></li>
<li>Switch/patch panel labels<br /></li>
<li>GENESYS walkthrough<br />
<ul class="org-ul">
<li>Simulator/x-parameters<br /></li>
<li>Sys parameter model<br /></li>
<li>GENESYS library<br /></li>
</ul></li>
<li><a href="https://www.minicircuits.com/WebStore/x_mwblock.html">minicircuits</a> web-API (searchAPI)<br /></li>
<li>extra server ideas?<br /></li>
<li>Where did we get SSL cert? How is it renewed?<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org18ab874" class="outline-2">
<h2 id="org18ab874">12:32 - S3 buckets</h2>
<div class="outline-text-2" id="text-org18ab874">
<ul class="org-ul">
<li>cf-templates X<br /></li>
<li>elasticbeanstalk X<br /></li>
<li>cjk-cascade-test X<br /></li>
<li>kops-xmicrowave-store X<br /></li>
<li>pki.xmicrowave.com KEEP<br /></li>
<li>prod-kops X<br /></li>
<li>x-microwave.com KEEP<br /></li>
<li>x-microwave.net KEEP<br /></li>
<li>xm-codedeploy X<br /></li>
<li>datapipeline KEEP<br /></li>
<li>elb logs KEEP<br /></li>
<li>raspi image X?<br /></li>
<li>serverless deploy stuff ??<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org4f6bc31" class="outline-2">
<h2 id="org4f6bc31"><span class="todo TODO">TODO</span> Centralized logging on S3</h2>
</div>
<div id="outline-container-org8e5ad64" class="outline-2">
<h2 id="org8e5ad64">13:19 - CASCADE DB</h2>
<div class="outline-text-2" id="text-org8e5ad64">
<ul class="org-ul">
<li>deploy.sh - <b>CI/CD</b> instance<br /></li>
<li>DockerFile<br />
<ul class="org-ul">
<li>alpine Linux, layered cache<br /></li>
<li>creates docker container on CI/CD instance<br /></li>
<li>CI/CD uploads on gitlab<br /></li>
<li><code>.gitlab-ci.yml</code> how it's deployed<br />
<ul class="org-ul">
<li>then <code>deploy.sh</code><br />
<ul class="org-ul">
<li>kills docker container<br /></li>
<li>removes it<br /></li>
<li>manage secret variables<br /></li>
<li>replace and run<br /></li>
<li>traefik: port router within docker<br /></li>
<li>network web: docker vLan equiv<br /></li>
</ul></li>
<li><i>Portainer is just a convenient human tool</i><br /></li>
</ul></li>
</ul></li>
</ul>
</div>

<div id="outline-container-org65c25ae" class="outline-3">
<h3 id="org65c25ae"><span class="todo TODO">TODO</span> centralized logging on docker</h3>
</div>
</div>

<div id="outline-container-org9d436cd" class="outline-2">
<h2 id="org9d436cd">13:53 Gitlab runner</h2>
<div class="outline-text-2" id="text-org9d436cd">
<ul class="org-ul">
<li>CI/CD machine<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org3a27026" class="outline-2">
<h2 id="org3a27026"><span class="todo TODO">TODO</span> edit .gitlab-ci files</h2>
<div class="outline-text-2" id="text-org3a27026">
<ul class="org-ul">
<li>don't overwrite temp folder (env, dp)<br /></li>
<li>see Sparameter viewerNX<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org79a49f4" class="outline-2">
<h2 id="org79a49f4">14:01 Genesys</h2>
<div class="outline-text-2" id="text-org79a49f4">
<ol class="org-ol">
<li>add-part json<br /></li>
<li>job queue, translate json to automation (mouse/click sequence)<br /></li>
<li>genesys runner<br /></li>

<li>integrate genesys in with cascade and filemaker info<br /></li>
</ol>
</div>
</div>

<div id="outline-container-org7dea3b7" class="outline-2">
<h2 id="org7dea3b7">14:05 Simulator</h2>
<div class="outline-text-2" id="text-org7dea3b7">
<ul class="org-ul">
<li>generated genesys XML library<br /></li>
<li>json data in mongoDB<br /></li>
<li>reverse proxy is similar to traefik<br /></li>
<li>converted json to genesys XML in simulator<br /></li>
<li>REDIS is used as the queue server by javascript in simulator<br /></li>
<li><i>Genesys XML format help - reach out to Carson</i><br />
<ul class="org-ul">
<li>filemaker genesys file scripts are documented, read those<br /></li>
</ul></li>
<li>Genesys packager<br />
<ul class="org-ul">
<li>update library from the website<br /></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org7277577" class="outline-2">
<h2 id="org7277577">14:28 Sys parameters</h2>
<div class="outline-text-2" id="text-org7277577">
<ul class="org-ul">
<li>cross between X params and S-params<br /></li>
<li>look for genesys "import/export sys parameters" on filemaker<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org6ebae39" class="outline-2">
<h2 id="org6ebae39">14:37 minicircuits web api</h2>
<div class="outline-text-2" id="text-org6ebae39">
<ul class="org-ul">
<li>SearchApi internally uses filemaker "SearchTool"<br /></li>
<li>minicircuits emulates older search api<br /></li>
<li>see "proto buf"<br /></li>

<li>filemaker -&gt; mer file (basically csv) -&gt; main.rs w/ serde library -&gt; rustoso tool<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org9400528" class="outline-2">
<h2 id="org9400528">14:47 Networking</h2>
<div class="outline-text-2" id="text-org9400528">
<ul class="org-ul">
<li>See networking in the wiki<br /></li>
<li>CIDR networking concepts<br /></li>
<li>pfBlocker Black list<br /></li>
</ul>
</div>
<div id="outline-container-orgfcf686d" class="outline-3">
<h3 id="orgfcf686d"><span class="todo TODO">TODO</span> colored lists, varying security levels</h3>
<div class="outline-text-3" id="text-orgfcf686d">
<ul class="org-ul">
<li>black -&gt; red -&gt; yellow<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc173cf9" class="outline-2">
<h2 id="orgc173cf9">14:55 UPS</h2>
<div class="outline-text-2" id="text-orgc173cf9">
<ul class="org-ul">
<li>don't rely on automatic shut down stuff currently<br /></li>
</ul>
</div>

<div id="outline-container-org7e88986" class="outline-3">
<h3 id="org7e88986"><span class="todo TODO">TODO</span> Find and/or reset login</h3>
</div>
<div id="outline-container-orgb336c47" class="outline-3">
<h3 id="orgb336c47"><span class="todo TODO">TODO</span> Automatic server shut down</h3>
</div>
</div>

<div id="outline-container-orgd16c54c" class="outline-2">
<h2 id="orgd16c54c">14:56 HA cluster</h2>
<div class="outline-text-2" id="text-orgd16c54c">
<ul class="org-ul">
<li>r610s can't run latest ESXi<br /></li>
<li>turn r610s into VMware HA SAN server (isczi)?<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org88f3c4a" class="outline-2">
<h2 id="org88f3c4a">15:00 Getting new servers</h2>
<div class="outline-text-2" id="text-org88f3c4a">
<ul class="org-ul">
<li>Dell servers<br /></li>
<li>Trend Micro custom built<br /></li>
<li>Ryzen servers, AMD epic.<br /></li>
<li>"whitebox" your own<br /></li>
<li>deals on craigslist<br /></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-11-20 Wed 00:00</p>
<p class="author">Author: Cole Turner, Carson Page</p>
<p class="date">Created: 2019-11-20 Wed 15:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
